package com.example.sony1.Seyedpour;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by SONY1 on 7/25/2015.
 */
public class FishData
{
    private List<Fish> Fishes=new ArrayList<Fish>();
    public List<Fish> getFishes()
    {
        return Fishes;
    }
    public FishData() {
        addItem(new Fish("اسکار", R.drawable.oscar, "نام علمی:Astronotus ocellatus\n" +
                "نام های رایج: اسکار\n" +
                "خانواده: Cichlidae\n" +
                "زیستگاه: بومی آمازون، پاراگوئه و شرق ونزوئلا\n" +
                "دما: 26 الی 28 درجه سانتیگراد\n" +
                "پ-هاش: 6.5 الی 7.5\n" +
                "سختی آب: 10 الی 15 درجه dh\n" +
                "طول بدن: در آکواریوم تا 30 الی 35 سانتیمتر رشد می کند\n" +
                "تغذیه: غذاهای گوشتی با منبع پروتئینی و غذاهای آماده و خشک در بازار\n" +
                "خلق و خو: متعادل و گاهی هم خشن، در صورتی که با سایر ماهیان گوشتخوار قوی جثه مانند نایف، پروت، تگزاس و... نگهداری شود مشکلی نخواهید داشت.\n" +
                "شناخت: اسکارها بومی آمازون، پاراگوئه و مناطقی از شرق ونزوئلا هستند. آنها ماهیانی هستند که در کف و در تمامی حجم آب در حال شنا می باشند. اسکارها در حالت طبیعی در آبهای کم عمق همراه با جریان ملایم و کف ماسه ای و یا گلی یافت می شوند. این ماهی ها بسیار باهوش هستند و قادرند که حیله های زیادی از خود نشان دهند و قادرند به سرعت شخصی که به آنها غذا می دهد را شناسایی کنند.اسکارها مایان سخت جانی هستند و در شرایط بسیار سخت نیز حتی علائم ظاهری خاصی را نشان نمی دهند با این حال بسیاری ممکن است تصور کنند که این جانداران زیبا نیازمند مراقبت خاصی نمی باشند، اما عدم مراقبت صحیح ازاین ماهی می تواند بیماری هایی را در پی داشته باشد.اسکارها ماهیان نسبتا پرخاشگری هستند و سعی دارند هر چیزی که در مخزن است و در اندازه دهان آنهاست ببلعند.\n"));

        addItem(new Fish("فرانتوزا",R.drawable.frantoza,"نام: فرانتوزا Frantoza\n" +
                "خانواده: Cichlidae سیکلیده یا سیچلاید (سیکلیده آفریقایی)\n" +
                "زیستگاه اصلی: دریاچه تانگانیکا(آفریقا)\n" +
                "اندازه: تا 35 سانتی متر در جنس نر رشد می کند.\n" +
                "دمای مناسب نگهداری: 25 تا 28 درجه سانتی گراد\n" +
                "پ-هاش: 7.5 الی 8.5\n" +
                "سیکلیدهای فرانتوزا در طبیعت بیش از 25 سال عمر کرده و جثه نرها به 35 سانتیمتر و ماده ها به 30 سانتیمتر خواهد رسید.آنها در هنگام تاریکی هوا وقتی دسته سایپروکرومیسمها به قسمت کف دریاچه برای استراحت و خواب به صورت دسته ای می روند این ماهی که هنوز هوشیار است سایپروکرومیسمهایی را که در دهانش جا می شوند؛ می خورد.\n" +
                "نگهداری: سیچلایدهای فرانتوزا بسیار آرامند و می توان با هر ماهی آرام دیگری یا سایر سیکلیدها نگهداری شوند ولی آرام بودنشان به این معنا نیست که آنها شکار نمی کنند بلکه هر موجود زنده آبزی که در دهانشان جا بگیرد را شکار کرده و می خورند.\n" +
                "تغذیه: غذاهایی با منبع پروتئینی بالا را میپسندند و اگر به آنها غذای زنده نیز بدهید بسیار مناسب حالشان است.به هر حال مانند سایر سیکلیدها می توانی به آنها غذاهای آماده یا گوشتی مانند دل و جگر گاو هم بدهید.\n"));
        //addItem(new Fish());

        addItem(new Fish("سیلور شارک",R.drawable.shark,"نام علمی: Balantiocheilos melanopterus\n" +
                "نام های رایج: سیلور شارک، شارک نقره ای\n" +
                "خانواده: Cyprinidae(کپور ماهیان)\n" +
                "اندازه: تا 35 سانتیمتر می تواند رشد کند.\n" +
                "دمای مناسب: 24 الی 28 درجه سانتی گراد\n" +
                "پ-هاش: 7 الی 7.5\n" +
                "زادگاه: سوماترا و تایلند\n" +
                "شناخت و نگهداری: سیلور شارک(Black Shark) یک ماهی بزرگ و شناگری سریع است این ماهی می تواند تقریبا تا 35 سانتیمتر رشد کند ولی در آکواریوم هایی که جای کافی برای شنا کردن ندارند انداره آنها کوچکتر از این مقدار می شود، رشد این ماهی نسبتا مناسب است و ماهیانی هستند که هر نوع غذایی را می خورند و هر چیزی که به داخل دهانشان برود دیگر خارج نخواهد شد.کمی قلمرو طلب هستند و با جثه بزرگی که در آینده پیدا می کنند می توانند باعث مزاحمت ماهیان کوچک آکواریوم شوند. آکواریوم حاوی این ماهی حتما دارای درپوش باشد زیرا ممکن است از آکواریوم به بیرون بپرد.\n"));
        addItem(new Fish("دراگون",R.drawable.dragon,"نام رایج: دراگون\n" +
                "نام علمی: Pseudoplatystoma fasciatum\n" +
                "خانواده: Pimelodidae\n" +
                "اندازه: در آکواریوم 50-60 سانتیمتر\n" +
                "دمای مناسب نگهداری: 24 الی 28 درجه سانتیگراد\n" +
                "پ-هاش: 7 الی 8\n" +
                "دراگون از تیره گربه ماهی های خوراکی به شمار می رود.این ماهیان بومی نواحی شمال آمریکای جنوبی و منطقه آمازونند و اندازه آنها گاه تا 1 متر هم میرسد و رشد سریعی دارند. شکل ظاهری ماهی به صورت کشیده و پهن است با پوزه ای پهن به شکل پارو یا منقار اردک و 3 جفت سبیل دراز که یک جفت آنها روی آرواره بالایی و 2 جفت دیگر در آرواره پایینی قرار گرفته است.نمونه های کوچک این ماهی در بازار آکواریومی جهان و ایران به فروش می رسد ولی پس از مدتی نگهداری این ماهی برای آکواریوم داران مقدور نمی باشد به این دلیل که دراگون ها به سرعت رشد کرده و سایز قابل توجهی پیدا خواهند کرد به گونه ای که ماهیانی که تا چند هفته پیش هم سایز آنها بودند اکنون به راحتی در دهان این ماهی جای می گیرند. این گونه مهاجم نیست ولی رحمی به ماهیانی که در دهانش جای می گیرند نمیکند.\n" +
                "برای نگهداری این ماهی به تانک بسیار بزرگ مثلا حدود 400 لیتر نیاز دارید که البته به دلیل سرعت بالای رشد آن باید از همان ابتدا به فکر خریدد این مخزن بزرگ باشید.کف را از ماسه بپوشانید بهتر است زیرا در هنگام شنا در کف کمتر به بدن آن آسیب میرساند.\n" +
                "معمولا از هر نوع غذای زنده و گوشتی تغذیه می شود. می توان از ماهی کلیکا و دل گاو هم برای تغذیه استفاده کرد. \n"));

        addItem(new Fish("ماهی شیشه ای",R.drawable.glassfish,"نام های رایج: گلس فیش، ماهی شیشه ای\n" +
                "خانواده: Ambassidae\n" +
                "ماهیان شیشه ای شامل همه ماهیانی است که دارای بدن شفاف می باشند.آنها بومی آسیا به خصوص پاکستان، هند، نپال، بنگلادش و تایلند بوده و تا اندازه 8 الی 9 سانتیمتر رشد می کنند. بدن این نوع ماهی بسیار کوک بوده و دارای نقاط سیاه و قرمز بر روی فلس هاست.نخاع ماهی از میان بدن آن قابل مشاهده می باشد.این ماهیان به آرامی در آبها، چشمه های تمیز، کانالها و شالیزارها شنا می کنند.آنها شناگرهای ماهری در سطح میانی آکواریوم ها بوده و در اسارت در صورت ایجاد شرایط مناسب آب، در سلامت کامل خواهند بود.آنها با تتراها، بارب ها، راس بوراس ها، ماهی رنگین کمان، گورامی، و کت فیش سازگار هستند.این ماهیان جزو ماهیان صلح جو هستند ولی گاهی شیطنت انها را نمی توان نادیده گرفت زیرا علاقه به گاز گرفتن باله و دم های بلند و زیبای ماهیان دارد که میتواند سبب از بین رفتن شعاع باله ای ماهی یا بیماری های عفونی باله آسیب دیده توسط توسط این ماهی شود.بعضی از گونه های گلس فیش در آب های شور نیز زندگی می کنند و ماهیان اهلی زندگی گروهی را به انفرادی ترجیح می دهند.\n" +
                "شرایط زیستی: کیفیت پایدار آب، درجه حرارت وسطوح PH از شرایط زیستی این ماهیان می باشد.دمای مناسب آب آنها 24 الی 26 درجه و PH 7 الی 8.5  مناسب حالشان است.\n" +
                "نگهداری: نگهداری آنها ساده است و می توانید با رعایت شرایط ذکر شده آنها را نگهداری کنید. سعی کنید تانک انتخابی شما به اندازه کافی بزرگ باشد و حتی الامکان از ماهیانی کنار آنها استفاده کنید که باله و دم بلندی نداشته باشند. آکواریوم گیاهی مناسب حال ای نوع ماهیان است هر چند گاهی دیده شده برگ گیاهان هم از گزند این ماهیان در امان نخواهد بود.\n"));

        addItem(new Fish("پلاتی تاکسیدو",R.drawable.pluti,"پلاتی تاکسیدو از جمله ماهیان آرام و صلح جو آکواریوم های گیاهی است. بخش زیادی از بدن این ماهی توسط لکه های سیاه فراوانی پوشیده شده است.\n" +
                "پلاتی به آکواریومی با حداقل حجم ۵۶ لیتر همراه با گیاهان فراوان نیاز دارد.پلاتی ماهی بسیار صلح جویی است و به همین خاطر گزینه ی بسیار مناسبی برای نگهداری در آکواریوم های اجتماعی به حساب می آید.دمای ۵/۱۷ تا ۲۵ درجه ی سانتی گراد و پی هاش ۷ تا ۲/۸ برای این ماهی مناسب است.\n" +
                "پلاتی از دسته ماهیان زنده زا محسوب می شود.جفت ماهی در سن ۳ تا ۴ ماهگی قادر به تولید مثل خواهند بود.ماهی نر دارای اندازه ی کوچک تر و رنگ روشن تری نسبت به ماهی ماده است.همچنین عضو جفتگیری در زیر شکم ماهی نر کاملا” مشخص است.نوزادان این ماهی نسبت به نوزادان سایر ماهی های زنده زا قوی تر هستند و در صورت متولد شدن در آکواریوم اصلی و در کنار سایر ماهی ها از شانس بیشتری برای زنده ماندن نسبت به نوزادان سایر ماهی های زنده زا برخوردار هستند.\n" +
                "پلاتی را می توان با انواع غذاهای خشک همچون پولکی تغذیه نمود.\n" +
                "پلاتی با ماهی هایی همچون گوپی، مولی، دم شمشیری، انواع تترا، رازبورا، دانیو، ماهی رنگین کمانی، آنجل و گورامی سازگاری دارد.\n"));
        addItem(new Fish("گورامی مون لایت",R.drawable.gourami,"گورامی مون لایت بومی کشور تایلند است. نام این ماهی که به معنی نور ماه است، به علت ویژگی بازتاب زیبای نور از بدن ماهی می باشد. گورامی نور ماه دارای بدنی نقره ای رنگ است. باله های این ماهی در جنس نر با افزایش سن به رنگ زرد و نارنجی تغییر پیدا می کند.\n" +
                "این ماهی جزء دسته ماهی های لابیرنت نیز می باشد.این بدین معنا است که این ماهی دارای دستگاه تنفس خاص و متفاوتی با سایر ماهی ها است. این ماهی ها دارای عضوی می باشند که به آن ها این امکان را می دهد تا مستقیما” از هوا تنفس کنند.این ویزگی به آن ها این اجازه را می دهد که در سطح آب شنا کنند.\n" +
                "گورامی مون لایت ماهی ای صلح جو است. حداقل حجم آکواریوم برای این ماهی ۱۰۰ لیتر، دمای مناسب برای آن ۲۲ تا ۲۷ درجه و پی هاش مناسب بین ۶ تا ۸/۸ می باشد.بهترین آکواریوم برای این ماهی، آکواریومی همراه با گیاهان طبیعی و تخته سنگ می باشد تا مکان هایی برای پنهان شدن ماهی فراهم آورد.\n" +
                "بهترین راه برای تشخیص گورامی نر از گورامی ماده توجه به باله ی پشتی ماهی است.در ماهی نر این باله بلند و نوک تیز است، در صورتی که در ماهی ماده کوتاه تر و دارای نوک گرد می باشد. در زمان جفتگیری ماهی نر لانه ای حبابی در زیر برگ ها می سازد و سپس شروع به جلب کردن ماهی ماده می کند. بدین صورت که در پشت آن حرکت می کند و آن را به مسیر تخمریزی هدایت می کند. در این زمان ماهی نر با باز کردن باله ها و تغییر رنگ خودنمایی می کند. هنگامی که این رفتار از ماهی نر مشاهده شد باید ارتفاع آب را کاهش داد و به حداکثر ۱۵ سانتی متر رساند. پس از تخمریزی باید ماهی ماده از آکواریوم خارج شود. زیرا ماهی نر وظیفه ی نگهداری از فرزندان را به عهده دارد و ممکن است که به ماهی ماده آسیب برساند. ماهی نر تا زمان خروج نوزادان از تخم، از آن ها مراقبت می کند. پس از خروج نوزادان از تخم، آب آکواریوم باید به طور مداوم سیفون شود. به خصوص در هفته ی سوم. نوزادان تازه متولد شده باید با آنفوزوئر یا نوزاد میگو تغذیه شوند.\n" +
                "گورامی  جانوری همه چیزخوار است و بهتر است که در رژیم غذایی آن انواع غذاها از جمله جلبک دریایی، غذاهای منجمد، کرم خونی و میگوی آب شور قرار گیرد.\n" +
                "این ماهی با ماهی هایی همچون مولی، دم شمشیری، بارب و انواع لوچ ها سازگاری دارد.\n"));

        addItem(new Fish("آنجل شکلاتی",R.drawable.chocolateangelfish,"آنجل شکلاتی شباهت زیادی به آنجل دودی دارد. این ماهی دارای بدنی قهوه ای و خاکستری رنگ است. در برخی مواقع سر این ماهی می تواند نقره ای باشد. تفاوت آنجل شکلاتی با آنجل دودی در بیشتر بودن خطوط و نقاط تیره بر روی بدن است.\n" +
                "بهترین تانک برای این ماهی،تانکی همراه با گیاه  و حداقل حجم ۱۱۰ لیتر دارای آب با پی هاش حدود ۵ تا ۷ می باشد.در آکواریوم این ماهی می توان تخته سنگ نیز قرار داد.اما باید توجه داشت که فضای کافی برای شنای این ماهی وجود داشته باشد.\n" +
                "بهترین راه برای جفتگیری از این ماهی این است که تعدادی از این ماهی در یک آکواریوم نگهداری شود تا جفت مورد نظر یکدیگر را پیدا کنند.پس از جفتگیری یک مکان صاف برای تخمگذاری لازم است.این مکان صاف می تواند یک تخته سنگ،یک برگ پهن و یا داخل کوزه باشد.دمای لازم برای تخمریزی حدود ۳۰درجه است و جریان آب نیز باید ملایم باشد.در هنگام تخمریزی ماهی ماده بر روی سطح صاف دراز کشیده و تخمریزی می نماید و سپس در پشت آن ماهی نر اسپرم خود را بر روی تخم ها ترشح می کند.بعد از حدودا” ۳ روز نوزادان از تخم خارج می شوند.در این هنگام باید آن ها را با نوزاد میگو یا غذاهای بسیار ریز تغذیه نمود تا زمانی که آن ها به اندازه ی کافی رشد کنند و بتوانند غذاهای معمولی را دریافت کنند.\n" +
                "آنجل شکلاتی نیاز دارد که با غذاهای گوناگون از جمله غذاهای خشک،غذاهای منجمد مانند کرم خونی و همچنین غذاهای زنده مانند میگوی آب شور و نوزاد سایر ماهی ها تغذیه شود.\n" +
                "آنجل شکلاتی با ماهی هایی مانند گوپی،مولی،پلاتی،دمشمشیری،تترا،رازبورا،گورامی و کریدوراس سازگاری دارد و می توان آن ها را در کنار هم نگهداری کرد.\n"));

    addItem(new Fish("آنجل پلاتینیوم",R.drawable.platinumangelfish,"آنجل پلاتینیوم دارای بدنی سفید براق است. هر چه سن ماهی بیشتر شود رنگ ماهی به سبز و آبی تمایل پیدا می کند. این گونه ی آنجل یکی از جدیدترین گونه هایی است که به تازگی وارد آکواریوم ها شده است.\n" +
            "بهترین تانک برای این ماهی،تانکی همراه با گیاه  و حداقل حجم ۱۱۰ لیتر دارای آب با پی هاش حدود ۵ تا ۷ می باشد.در آکواریوم این ماهی می توان تخته سنگ نیز قرار داد.اما باید توجه داشت که فضای کافی برای شنای این ماهی وجود داشته باشد.\n" +
            "بهترین راه برای جفتگیری از این ماهی این است که تعدادی از این ماهی در یک آکواریوم نگهداری شود تا جفت مورد نظر یکدیگر را پیدا کنند.پس از جفتگیری یک مکان صاف برای تخمگذاری لازم است.این مکان صاف می تواند یک تخته سنگ،یک برگ پهن و یا داخل کوزه باشد.دمای لازم برای تخمریزی حدود ۳۰درجه است و جریان آب نیز باید ملایم باشد.در هنگام تخمریزی ماهی ماده بر روی سطح صاف دراز کشیده و تخمریزی می نماید و سپس در پشت آن ماهی نر اسپرم خود را بر روی تخم ها ترشح می کند.بعد از حدودا” ۳ روز نوزادان از تخم خارج می شوند.در این هنگام باید آن ها را با نوزاد میگو یا غذاهای بسیار ریز تغذیه نمود تا زمانی که آن ها به اندازه ی کافی رشد کنند و بتوانند غذاهای معمولی را دریافت کنند.\n" +
            "آنجل پلاتینیوم نیاز دارد که با غذاهای گوناگون از جمله غذاهای خشک،غذاهای منجمد مانند کرم خونی و همچنین غذاهای زنده مانند میگوی آب شور و نوزاد سایر ماهی ها تغذیه شود.\n" +
            "آنجل پلاتینیوم با ماهی هایی مانند گوپی،مولی،پلاتی،دمشمشیری،تترا،رازبورا،گورامی و کریدوراس سازگاری دارد و می توان آن ها را در کنار هم نگهداری کرد.\n"));

    addItem(new Fish("آنجل دودی",R.drawable.smokeyangelfish,"آنجل دودی دارای بدنی به رنگ قهوه ای و خاکستری تیره است. رنگ بدن این ماهی به سمت انتهای باله ها تیره تر می شود.\n" +
            "بهترین تانک برای این ماهی،تانکی همراه با گیاه  و حداقل حجم ۱۱۰ لیتر دارای آب با پی هاش حدود ۵ تا ۷ می باشد.در آکواریوم این ماهی می توان تخته سنگ نیز قرار داد.اما باید توجه داشت که فضای کافی برای شنای این ماهی وجود داشته باشد.\n" +
            "بهترین راه برای جفتگیری از این ماهی این است که تعدادی از این ماهی در یک آکواریوم نگهداری شود تا جفت مورد نظر یکدیگر را پیدا کنند.پس از جفتگیری یک مکان صاف برای تخمگذاری لازم است.این مکان صاف می تواند یک تخته سنگ،یک برگ پهن و یا داخل کوزه باشد.دمای لازم برای تخمریزی حدود ۳۰درجه است و جریان آب نیز باید ملایم باشد.در هنگام تخمریزی ماهی ماده بر روی سطح صاف دراز کشیده و تخمریزی می نماید و سپس در پشت آن ماهی نر اسپرم خود را بر روی تخم ها ترشح می کند.بعد از حدودا” ۳ روز نوزادان از تخم خارج می شوند.در این هنگام باید آن ها را با نوزاد میگو یا غذاهای بسیار ریز تغذیه نمود تا زمانی که آن ها به اندازه ی کافی رشد کنند و بتوانند غذاهای معمولی را دریافت کنند.\n" +
            "آنجل دودی نیاز دارد که با غذاهای گوناگون از جمله غذاهای خشک،غذاهای منجمد مانند کرم خونی و همچنین غذاهای زنده مانند میگوی آب شور و نوزاد سایر ماهی ها تغذیه شود.\n" +
            "آنجل دودی با ماهی هایی مانند گوپی،مولی،پلاتی،دمشمشیری،تترا،رازبورا،گورامی و کریدوراس سازگاری دارد و می توان آن ها را در کنار هم نگهداری کرد.\n" +
            "\n"));

    addItem(new Fish("آنجل کوی",R.drawable.koiangelfish,"آنجل کوی دارای بدنی طلائی به همراه خطوط و نقاط نقره ای بر روی آن است. ویژگی بارز این ماهی وجود خطوط نارنجی بر روی بدن به خصوص بر روی سر است.\n" +
            "بهترین تانک برای این ماهی،تانکی همراه با گیاه  و حداقل حجم ۱۱۰ لیتر دارای آب با پی هاش حدود ۵ تا ۷ می باشد. در آکواریوم این ماهی می توان تخته سنگ نیز قرار داد.اما باید توجه داشت که فضای کافی برای شنای این ماهی وجود داشته باشد.\n" +
            "بهترین راه برای جفتگیری از این ماهی این است که تعدادی از این ماهی در یک آکواریوم نگهداری شود تا جفت مورد نظر یکدیگر را پیدا کنند. پس از جفتگیری یک مکان صاف برای تخمگذاری لازم است. این مکان صاف می تواند یک تخته سنگ،یک برگ پهن و یا داخل کوزه باشد. دمای لازم برای تخمریزی حدود ۳۰درجه است و جریان آب نیز باید ملایم باشد. در هنگام تخمریزی ماهی ماده بر روی سطح صاف دراز کشیده و تخمریزی می نماید و سپس در پشت آن ماهی نر اسپرم خود را بر روی تخم ها ترشح می کند. بعد از حدودا” ۳ روز نوزادان از تخم خارج می شوند.در این هنگام باید آن ها را با نوزاد میگو یا غذاهای بسیار ریز تغذیه نمود تا زمانی که آن ها به اندازه ی کافی رشد کنند و بتوانند غذاهای معمولی را دریافت کنند.\n" +
            "آنجل کوی نیاز دارد که با غذاهای گوناگون از جمله غذاهای خشک،غذاهای منجمد مانند کرم خونی و همچنین غذاهای زنده مانند میگوی آب شور و نوزاد سایر ماهی ها تغذیه شود.\n" +
            "آنجل کوی با ماهی هایی مانند گوپی،مولی،پلاتی،دمشمشیری،تترا،رازبورا،گورامی و کریدوراس سازگاری دارد و می توان آن ها را در کنار هم نگهداری کرد.\n" +
            "\n"));

    addItem(new Fish("گوپی بلک فانتوم",R.drawable.blackphantom,"گوپی بلک فانتوم دارای کمری کاملا” سیاه رنگ است. بدن این ماهی از انتهای سر تا انتهای دم کاملا” به رنگ سیاه است. سر این ماهی به رنگ نقره ای است. اندازه این ماهی که بومی ونزویلا، ترینیداد، شمال برزیل و گینه است در ماده ها به ۶ و در نرها به ۳سانتی متر می رسد. از این ماهی برای کنترل تخم و نوزاد حشرات استفاده می شود. در آکواریوم ها بسیار مقاوم بوده و تغذیه و تکثیر آن ها نسبتا” آسان است. این ماهی ها هیچ گونه مزاحمتی برای سایر ماهی های آکواریوم ایجاد نمی کنند. نرها همواره مواظب ماده ها بوده و در هر فرصت ممکن است اسپرم خود را به آن ها منتقل نمایند.اسپرم حاصله از یک بار انتقال میتواند تا ۶ بار تخم ها را بارور نماید.\n" +
            "آکواریومی با پوشش انبوه گیاهی فضایی مناسب را برای این ماهی ایجاد می کند. دمای ۲۰ تا ۲۷٫۵ درجه ی سانتی گراد و پی هاش ۵٫۵ تا ۸٫۰ برای این ماهی مناسب است.\n" +
            "ماهی گوپی از دسته ماهیان زنده زا است و دارای لقاح داخلی می باشد. ماهی ماده پس از هر مرتبه بارور شدن توسط ماهی نر می تواند تا ۵ مرتبه زایمان نماید. ماهی ماده قبل از زایمان دارای شکمی متورم است و معمولا” در مقابل شیشه ی آکواریوم شنای عمودی می کند. در صورت مشاهده ی به موقع ماهی ماده ی باردار می توان آن را به زایشگاه منتقل نمود تا زایمان نماید. در این صورت نوزادان از حمله ی سایر ماهی ها در امان خواهند ماند. زایمان ماهی گوپی در آکواریوم های شلوغ و گیاهی نیز موفقیت آمیز است. در چنین آکواریوم هایی نوزادان در لا به لای گیاهان پنهان می شوند و از حمله ی سایر ماهی ها در امان می مانند. در هر بار زایمان حداکثر ۴۰ تا ۵۰ نوزاد متولد می شوند. نوزادان گوپی جثه ی نسبتا” بزرگی دارند و همچنین از مقاومت خوبی برخوردارند. نوزادان پس از یک ماه بالغ می شوند و نر ها از ماده ها متمایز می گردند. نر ها دارای عضو جفتگیری در زیر شکم خود هستند که ماده ها فاقد این عضو هستند. پس از ۳ ماه دم ماهی های نر به زیبایی یک ماهی مسن می شود. گوپی ها عمر زیادی ندارند و تنها ۲ سال عمر می کنند.\n" +
            "گوپی از دسته ماهیان گیاهخوار محسوب می شود و تغذیه ی آن با انواع غذاهای مخصوص ماهیان گیاهخوار امکان پذیر است. تترا گوپی یکی از بهترین غذاهای موجود برای گوپی است. این غذا موجب افزایش سرعت رشد ماهی و همچنین رنگپذیری بهتر این ماهی شود.\n" +
            "\n"));

    addItem(new Fish("سیچلاید آکارای آبی",R.drawable.blueacaracichlid,"سیچلاید بلو آکارا دارای بدنی قهوه ای به همراه خطوط و نقاط فراوان آبی رنگ بر روی آن است. جنس نر دارای باله های بلندتر و رنگ براق تری نسبت به جنس ماده است. انتهای باله های این ماهی نارنجی و قرمز رنگ است. زیستگاه این ماهی آمریکای مرکزی است.\n" +
            "آکواریومی با حداقل حجم ۵۰ گالن به همراه بستری با شن ریز برای این ماهی مناسب است. بهتر است با قرار دادن تخته سنگ در آکواریوم فضاهایی را برای پنهان شدن این ماهی فراهم نمود. سیچلاید آکارا به طور کلی رفتاری مصالحت آمیز با سایر ماهی های هم اندازه ی خود دارد. اما در زمان تخمریزی مقداری پرخاشگر و قلمروطلب می شود. این ماهی حداکثر تا ۶ سانتی متر رشد می کند. دمای ۲۵ تا ۲۷٫۵ درجه ی سانتی گراد برای سیچلاید آکارا مناسب است.\n" +
            "جفتگیری و تکثیر این ماهی در صورتی که در گله ( تعداد ۶ تا ۷ عدد ) نگهداری شوند کار آسانی است. تخمریزی تقریبا” هر دو هفته یک بار انجام می شود. البته این در شرایطی است که لاروها از آکواریوم خارج شوند. جنس نر و ماده هر دو با هم به مراقبت از فرزندان می پردازند.\n" +
            "سیچلاید آکارا از جمله ماهیان گوشتخوار است که می توان آن را با انواع غذاهای بسته بندی مخصوص سیچلاید ها تغذیه نمود.\n" +
            "\n"));


    }
    public void addItem(Fish item)
    {
        Fishes.add(item);
    }
}
